"""
Задача №1.
Для даного числа n < 100 необхідно закінчити фразу «На лузі пасеться…» одним
з можливих продовжень: n корів, n корова, n корови, правильно обравши
закінчення. Вводиться натуральне число. Програма повинна вивести введене
число n і одне зі слів: koriv, korova або korovy. Між числом і словом повинен
стояти один пропуск.


Автор: Жулід А А
"""
n = int(input("Введіть натуральне число менше 100: "))
k = n%10
if 0 < n < 100:
    if k == 1:
        print(n, "корова")
    elif k == 2 or k == 3 or k == 4:
        print(n, "корови")
    else:
        print(n, "корів")
else:
    print ("Ваше число більше за 100")
