"""
Задача №2.
На станції ремонту автомобілів працює кілька працівників. Якщо який-небудь
працівник працює понад 40 годин на тиждень, він отримує в 1,5 рази більше від
звичайної погодинної оплати. Розробіть програму, яка розраховує заробітну
плату працівника, включаючи оплату за додаткові години. Програма отримує
на вхід два цілих числа - кількість робочих годин і ставку погодинної оплати.


Автор: Жулід А А
"""

h = int(input("Введіть кількість робочих годин: "))
stavka = float(input("Введіть ставку погодинної оплати: "))
if h > 40:
    zp = h*stavka*1.5
    print ("Ваша заробітня плата: ", zp)
else:
    zp = h*stavka
    print("Ваша заробітня плата: ", zp)
